In [2]:
#실습:  import pandas  

import pandas as pd

# 1. 데이터 프레임을 파일로부터 생성
* pd.read_csv() 사용

In [13]:
# 데이터 파일 읽어 오기  - students.csv
df = pd.read_csv("./pandas/students.csv")
df

   20190001   Hong Gildong  84  73
0  20190002      Lee Jieun  92  89
1  20190007    Kim Cheolsu  57  62
2  20190009   Lee Yeonghee  81  84
3  20190011     Ha Donghun  58  68
4  20190015    Lee Sangsun  77  44
5  20190007    Kim Cheolsu  57  62

In [117]:
#  header = None
df = pd.read_csv("./pandas/students.csv", header=None, names=["stuid","name","mid","final"])
df

      stuid           name  mid  final
0  20190001   Hong Gildong   84     73
1  20190002      Lee Jieun   92     89
2  20190007    Kim Cheolsu   57     62
3  20190009   Lee Yeonghee   81     84
4  20190011     Ha Donghun   58     68
5  20190015    Lee Sangsun   77     44
6  20190007    Kim Cheolsu   57     62

In [6]:
# 데이터 프레임 생성 후, 열 이름(헤더)  지정 가능 
# df.columns
df.columns = ["stuid","name","mid","final"]
df

      stuid           name  mid  final
0  20190001   Hong Gildong   84     73
1  20190002      Lee Jieun   92     89
2  20190007    Kim Cheolsu   57     62
3  20190009   Lee Yeonghee   81     84
4  20190011     Ha Donghun   58     68
5  20190015    Lee Sangsun   77     44
6  20190007    Kim Cheolsu   57     62

In [15]:
# 컬럼들이 쉼표로 구분되어 있지 않은 경우
# 예) 탭으로 구분되어 있는 경우 delimiter = '\t'
df = pd.read_csv("./pandas/students_tab.txt", header=None, names=["stuid","name","mid","final"], delimiter = '\t')
df

      stuid          name  mid  final
0  20180001  Hong Gildong   84     73
1  20180002     Lee Jieun   92     89
2  20180007   Kim Cheolsu   57     62
3  20180009  Lee Yeonghee   81     84
4  20180011    Ha Donghun   58     68

# 2. 데이터 프레임을 딕셔너리/리스트로 생성
## (1) 딕셔너리로 생성

In [17]:
data_dic = {
    "name": ["Kim", "Lee", "Youn", "Lee", "Kim"],
    "year": [2014, 2015, 2016, 2015, 2016],
    "points": [1.5, 1.7, 3.6, 2.4, 2.9]}

In [19]:
df_dic = pd.DataFrame(data_dic)
df_dic

   name  year  points
0   Kim  2014     1.5
1   Lee  2015     1.7
2  Youn  2016     3.6
3   Lee  2015     2.4
4   Kim  2016     2.9

In [23]:
df_dic[['name', 'points']]

   name  points
0   Kim     1.5
1   Lee     1.7
2  Youn     3.6
3   Lee     2.4
4   Kim     2.9

## (2) 리스트로 데이터프레임 생성

In [26]:
data_list = [[ "Kim", 2014, 1.5 ], 
             ["Lee", 2015, 1.7], 
             ["Youn", 2016, 3.6]] 
title_list = ['name', 'year', 'points']

In [27]:
df_list = pd.DataFrame(data_list, columns=title_list)
df_list

   name  year  points
0   Kim  2014     1.5
1   Lee  2015     1.7
2  Youn  2016     3.6

# 3. 파일로 데이터프레임을 저장
* df.to_csv()

In [29]:
df_list.to_csv("./pandas/df_list_1.csv", header=False, index=False)

In [31]:
df

      stuid           name  mid  final
0  20190001   Hong Gildong   84     73
1  20190002      Lee Jieun   92     89
2  20190007    Kim Cheolsu   57     62
3  20190009   Lee Yeonghee   81     84
4  20190011     Ha Donghun   58     68
5  20190015    Lee Sangsun   77     44
6  20190007    Kim Cheolsu   57     62

In [32]:
df.describe()

              stuid        mid      final
count  7.000000e+00   7.000000   7.000000
mean   2.019001e+07  72.285714  68.857143
std    4.894117e+00  14.693698  15.082314
min    2.019000e+07  57.000000  44.000000
25%    2.019000e+07  57.500000  62.000000
50%    2.019001e+07  77.000000  68.000000
75%    2.019001e+07  82.500000  78.500000
max    2.019002e+07  92.000000  89.000000

In [47]:
df['stuid']

0    20190001
1    20190002
2    20190007
3    20190009
4    20190011
5    20190015
6    20190007
Name: stuid, dtype: object

In [39]:
import numpy as np

In [48]:
df['stuid'] = df['stuid'].astype(np.str) #int에서 object(str)로 형변환
df['stuid']

0    20190001
1    20190002
2    20190007
3    20190009
4    20190011
5    20190015
6    20190007
Name: stuid, dtype: object

In [42]:
type(df)

pandas.core.frame.DataFrame

In [45]:
type(df['stuid'])

pandas.core.series.Series

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stuid   7 non-null      int64
 1   name    7 non-null      object
 2   mid     7 non-null      int64
 3   final   7 non-null      int64
dtypes: int64(3), object(1)
memory usage: 352.0+ bytes

# 4. 중복 데이터 삭제하기

In [52]:
df.head() #df.tail()

      stuid           name  mid  final
0  20190001   Hong Gildong   84     73
1  20190002      Lee Jieun   92     89
2  20190007    Kim Cheolsu   57     62
3  20190009   Lee Yeonghee   81     84
4  20190011     Ha Donghun   58     68

##  (1) 중복된 데이터 확인하기
* df.duplicated() 사용

In [54]:
df.duplicated(keep=False)

0    False
1    False
2     True
3    False
4    False
5    False
6     True
dtype: bool

In [61]:
df.duplicated('stuid')

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

## (2) 중복 데이터 삭제하기
* df.drop_duplicates()

In [55]:
df

      stuid           name  mid  final
0  20190001   Hong Gildong   84     73
1  20190002      Lee Jieun   92     89
2  20190007    Kim Cheolsu   57     62
3  20190009   Lee Yeonghee   81     84
4  20190011     Ha Donghun   58     68
5  20190015    Lee Sangsun   77     44
6  20190007    Kim Cheolsu   57     62

In [59]:
df.drop_duplicates(inplace=True) #inplace 변경된 값을 실제로 적용
df

      stuid           name  mid  final
0  20190001   Hong Gildong   84     73
1  20190002      Lee Jieun   92     89
2  20190007    Kim Cheolsu   57     62
3  20190009   Lee Yeonghee   81     84
4  20190011     Ha Donghun   58     68
5  20190015    Lee Sangsun   77     44

# 5. 정렬
* 행/열이름 기준 정렬
    * df.sort_index(axis=0, ascending=True) # 오름차순
* 값기준 정렬
    * df.sort_values(by  = '열이름', ascending=False) # 내림차순

* **실습)** 중간고사를 기준으로 내림차순으로 정렬

In [66]:
df.sort_index(axis=1, ascending=True)

   final  mid           name     stuid
0     73   84   Hong Gildong  20190001
1     89   92      Lee Jieun  20190002
2     62   57    Kim Cheolsu  20190007
3     84   81   Lee Yeonghee  20190009
4     68   58     Ha Donghun  20190011
5     44   77    Lee Sangsun  20190015

In [64]:
df.sort_values(by = 'mid', ascending=False)

      stuid           name  mid  final
1  20190002      Lee Jieun   92     89
0  20190001   Hong Gildong   84     73
3  20190009   Lee Yeonghee   81     84
5  20190015    Lee Sangsun   77     44
4  20190011     Ha Donghun   58     68
2  20190007    Kim Cheolsu   57     62

# 6. 데이터 프레임의 열을 선택
* df['열이름']
* df.열이름

문제) mid 열 읽기

In [67]:
df['mid']

0    84
1    92
2    57
3    81
4    58
5    77
Name: mid, dtype: int64

In [69]:
df.mid

0    84
1    92
2    57
3    81
4    58
5    77
Name: mid, dtype: int64

In [ ]:
# 2개 이상의 열 가져오기  df[[열이름1, 열이름2]]

In [68]:
df[['stuid','mid']]

      stuid  mid
0  20190001   84
1  20190002   92
2  20190007   57
3  20190009   81
4  20190011   58
5  20190015   77

# 7. 새로운 열 추가 및 수정
* 열이름 **total** 추가

In [70]:
df['total'] = 0
df

      stuid           name  mid  final  total
0  20190001   Hong Gildong   84     73      0
1  20190002      Lee Jieun   92     89      0
2  20190007    Kim Cheolsu   57     62      0
3  20190009   Lee Yeonghee   81     84      0
4  20190011     Ha Donghun   58     68      0
5  20190015    Lee Sangsun   77     44      0

In [72]:
# total =  mid + final
df['total'] = df['mid'] + df['final']
df

      stuid           name  mid  final  total
0  20190001   Hong Gildong   84     73    157
1  20190002      Lee Jieun   92     89    181
2  20190007    Kim Cheolsu   57     62    119
3  20190009   Lee Yeonghee   81     84    165
4  20190011     Ha Donghun   58     68    126
5  20190015    Lee Sangsun   77     44    121

* **실습)** 열이름 average 추가

In [118]:
# 실습: 평균 = (Mid + Final) / 2 
df['average'] =(df['mid'] + df['final']) / 2
#df['average'] = df['total'] / 2
df

      stuid           name  mid  final  average
0  20190001   Hong Gildong   84     73     78.5
1  20190002      Lee Jieun   92     89     90.5
2  20190007    Kim Cheolsu   57     62     59.5
3  20190009   Lee Yeonghee   81     84     82.5
4  20190011     Ha Donghun   58     68     63.0
5  20190015    Lee Sangsun   77     44     60.5
6  20190007    Kim Cheolsu   57     62     59.5

 
* **실습**) grade 추가 60점이상이면 pass 아니면 fail

In [122]:
df['grade'] = df['average'] >= 60
df

      stuid           name  mid  final  average  grade
0  20190001   Hong Gildong   84     73     78.5   True
1  20190002      Lee Jieun   92     89     90.5   True
2  20190007    Kim Cheolsu   57     62     59.5  False
3  20190009   Lee Yeonghee   81     84     82.5   True
4  20190011     Ha Donghun   58     68     63.0   True
5  20190015    Lee Sangsun   77     44     60.5   True
6  20190007    Kim Cheolsu   57     62     59.5  False

In [124]:
df[ df['average'] >= 60 ]

      stuid           name  mid  final  average  grade
0  20190001   Hong Gildong   84     73     78.5   True
1  20190002      Lee Jieun   92     89     90.5   True
3  20190009   Lee Yeonghee   81     84     82.5   True
4  20190011     Ha Donghun   58     68     63.0   True
5  20190015    Lee Sangsun   77     44     60.5   True

* **실습**) grade 항목 삭제 : del df['열이름']

In [125]:
del df['grade']
df

      stuid           name  mid  final  average
0  20190001   Hong Gildong   84     73     78.5
1  20190002      Lee Jieun   92     89     90.5
2  20190007    Kim Cheolsu   57     62     59.5
3  20190009   Lee Yeonghee   81     84     82.5
4  20190011     Ha Donghun   58     68     63.0
5  20190015    Lee Sangsun   77     44     60.5
6  20190007    Kim Cheolsu   57     62     59.5

* **열이름 Grade 추가**
    * apply() 사용

In [126]:
def calc_grade(tot):
    if tot >=90:
        grade = 'A'
    elif tot >=80:
        grade = 'B'
    elif tot >=70:
        grade = 'C'
    elif tot >=60:
        grade = 'D'
    else:
        grade = 'F'
        
    return grade

In [127]:
df['grade'] = df['average'].apply(calc_grade)
df

      stuid           name  mid  final  average grade
0  20190001   Hong Gildong   84     73     78.5     C
1  20190002      Lee Jieun   92     89     90.5     A
2  20190007    Kim Cheolsu   57     62     59.5     F
3  20190009   Lee Yeonghee   81     84     82.5     B
4  20190011     Ha Donghun   58     68     63.0     D
5  20190015    Lee Sangsun   77     44     60.5     D
6  20190007    Kim Cheolsu   57     62     59.5     F

## Group by
데이터에서 정보를 취하기 위하여 그룹별로 묶음

In [90]:
df['dept'] = ["CSE", "EE", "CSE", "CSE", "IME", "EE"] # 테스트를 위해 학과 추가

In [91]:
df

      stuid           name  mid  final  total  average grade dept
0  20190001   Hong Gildong   84     73    157     78.5     C  CSE
1  20190002      Lee Jieun   92     89    181     90.5     A   EE
2  20190007    Kim Cheolsu   57     62    119     59.5     F  CSE
3  20190009   Lee Yeonghee   81     84    165     82.5     B  CSE
4  20190011     Ha Donghun   58     68    126     63.0     D  IME
5  20190015    Lee Sangsun   77     44    121     60.5     D   EE

In [92]:
groupby_dept = df.groupby("dept")
groupby_dept

In [93]:
groupby_dept.groups

{'CSE': [0, 2, 3], 'EE': [1, 5], 'IME': [4]}

In [97]:
for x in groupby_dept:
    break

In [98]:
x[1]

      stuid           name  mid  final  total  average grade dept
0  20190001   Hong Gildong   84     73    157     78.5     C  CSE
2  20190007    Kim Cheolsu   57     62    119     59.5     F  CSE
3  20190009   Lee Yeonghee   81     84    165     82.5     B  CSE

In [99]:
for name, group in groupby_dept:
    print(name, len(group))
    print(group)
    print()

CSE 3
      stuid           name  mid  final  total  average grade dept
0  20190001   Hong Gildong   84     73    157     78.5     C  CSE
2  20190007    Kim Cheolsu   57     62    119     59.5     F  CSE
3  20190009   Lee Yeonghee   81     84    165     82.5     B  CSE

EE 2
      stuid          name  mid  final  total  average grade dept
1  20190002     Lee Jieun   92     89    181     90.5     A   EE
5  20190015   Lee Sangsun   77     44    121     60.5     D   EE

IME 1
      stuid         name  mid  final  total  average grade dept
4  20190011   Ha Donghun   58     68    126     63.0     D  IME

In [101]:
df.groupby("dept").average.mean()

dept
CSE    73.5
EE     75.5
IME    63.0
Name: average, dtype: float64

# Unique
+ 중복 값이 있을 때, 중복 없이 어떤 값들이 있는 확인
    + df['열이름'].unique()

In [102]:
# 실습: 학과의 종류?
df['dept'].unique()

array(['CSE', 'EE', 'IME'], dtype=object)

+ 유니크한 값별로 몇개의 데이터가 있는지 확인
    + df['열이름'].value_counts()

In [103]:
# 실습: 학과별 학생수?
df['dept'].value_counts()

CSE    3
EE     2
IME    1
Name: dept, dtype: int64

# NaN 처리

In [112]:
import pandas as pd
school_id_list = [{'name': 'Tom', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0      Tom  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

### NaN 또는 None 확인

In [105]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [109]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [107]:
df.isnull().sum()

name    0
job     0
age     2
dtype: int64

### NaN  값 변경하기
+ NaN 값을 vlaue 로 변경
    + df['열이름'].fillna(value)

In [113]:
# 실습 :  0으로 변경
#df = df['age'].fillna(0)
df

      name      job   age
0      Tom  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [114]:
# 삭제 
df.dropna()

      name      job   age
0      Tom  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0

노트북파일(.ipynb) 파일 합치기

$pip install nbmerge
$nbmerge t1.ipynb t2.ipynb -o t3.ipynb